---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.IneligibleElementsInAssembly
source: html/e125d0cc-ee90-23c4-f3cf-38bfb6089413.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.IneligibleElementsInAssembly Property

Ineligible elements in assembly.

## Syntax (C#)
```csharp
public static FailureDefinitionId IneligibleElementsInAssembly { get; }
```